


const colors = ["🟥", "🟧", "🟨", "🟩", "🟦", "🟪", "🟫"];

const grid1=[
["🟥", "🟧", "🟨", "🟩", "🟦", "🟥", "🟧"],     
["🟨", "🟩", "🟦", "🟥", "🟨", "🟩", "🟦"],     
["🟥", "🟧", "🟨", "🟩", "🟦", "🟥", "🟨"],     
["🟩", "🟦", "🟥", "🟧", "🟨", "🟩", "🟦"],     
["🟨", "🟥", "🟧", "🟨", "🟩", "🟦", "🟥"],     
["🟦", "🟩", "🟨", "🟥", "🟧", "🟩", "🟦"],    
["🟥", "🟧", "🟨", "🟩", "🟦", "🟨", "🟥"]
]


function findMissingColors(grid) {
  grid.forEach(element => {
          element.filter(colors=>colors === colors)
  });
  
}

console.log(findMissingColors(grid1))